%% simu2_2 运动点目标的回波仿真
%% 参数初始化
PRF = 2e3; % 脉冲重复频率
PRI = 1/PRF; % 脉冲重复间隔
fs = 80e6; % 采样率
Bw = 20e6; % 带宽
tp = 5e-6; % 脉宽
K = Bw / tp; % 调制斜率
% N = 6/60 * PRF; % 根据时长(s)来确定脉冲个数
N = 30; % 脉冲数定为30个 
smp_mc = 20; % 单次采样时间的比脉宽
t = 0:1/fs:smp_mc*Tp + Tp; % 单次采样的时间长度为21个脉宽 (一个PRI可以包含100个脉冲，占空比为1%)
N_smp = length(t); % 采样点个数
Rmax = smp_mc * Tp * c / 2; % 本程序可以探测的最远距离！！ 实际应该是 1/2 * c * PRI


% 目标参数
N_tgt = 3; 
R_tgt = [100, 110, 150]; % 目标距离
V = [10, 20, 100]; % 目标速度
RCS = [0.6, 0.7, 0.8]; % RCS

%% 生成回波矩阵（二维矩阵）
sig_r = zeros(N, N_smp); % 纵坐标脉冲数目 横坐标为采样时间
for i = 1:N
    ta = (i - 1) * PRI;
    sri = 0;
    for tgt = 1:N_tgt
        t_delay = 2*(R_tgt())
        
        
        
        
        
        
        
        
        
        
        
        
